app/Http/Controllers/User/DailyReportController.php

    public function delete(int $id): RedirectResponse
    {
        $this->dailyReport->find($id)->delete();
---
select * from `daily_reports` where `daily_reports`.`id` = 13 and `daily_reports`.`deleted_at` is null limit 1

    public function update(DailyReportRequest $request, int $id): RedirectResponse
    {
        $input = $request->all();
        $this->dailyReport->find($id)->fill($input)->save();
---
select * from `daily_reports` where `daily_reports`.`id` = 13 and `daily_reports`.`deleted_at` is null limit 1