app/Models/DailyReport.php

select * from `daily_reports` where `user_id` = 4 and `daily_reports`.`deleted_at` is null order by `reporting_time` desc limit 10 offset 0
select count(*) as aggregate from `daily_reports` where `user_id` = 4 and `daily_reports`.`deleted_at` is null
---
    public function fetchByUserId(int $userId, array $params = [], int $pagesize = Null): LengthAwarePaginator
    {
        return $this
            ->where('user_id', $userId)
            ->when(isset($params['reporting_time']),
                function($query) use ($params) {
                    $reportingTime = new Carbon($params['reporting_time']);
                    $query->whereBetween(
                        'reporting_time',
                        [
                            $reportingTime->firstOfMonth()->format('Y-m-d H:i:s'),
                            $reportingTime->lastOfMonth()->format('Y-m-d H:i:s')
                        ]
                    );
                }
            )
            ->orderBy(self::DEFAULT_ORDER, self::DEFAULT_ORDER_TYPE)
            ->paginate($pagesize);